In [25]:
import pandas as pd
import os

In [26]:
os.getcwd()

'/workspace/scripts'

In [27]:
movies_df = pd.read_csv('/workspace/data/raw/movies.csv')
ratings_df = pd.read_csv('/workspace/data/raw/ratings.csv')

In [28]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [29]:
movies_df['genres'].str.split('|').explode().unique()

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [30]:
row_to_drop = movies_df[movies_df['genres'] == '(no genres listed)'].index
movies_df = movies_df.drop(row_to_drop)

In [31]:
movies_df[movies_df['genres'] == '(no genres listed)']

Empty DataFrame
Columns: [movieId, title, genres]
Index: []

In [32]:
movies_df['Year'] = movies_df['title'].str.extract(r'\((\d{4})\)')
movies_df['title'] = movies_df['title'].str.replace(r'\s*\(\d{4}\)', '', regex=True)

In [33]:
movies_df.head()

,movieId,title,genres,Year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995

In [34]:
rows=movies_df[movies_df['Year'].isnull()]
rows

      movieId              title                  genres Year
6059    40697          Babylon 5                  Sci-Fi  NaN
9031   140956   Ready Player One  Action|Sci-Fi|Thriller  NaN
9179   149334  Nocturnal Animals          Drama|Thriller  NaN
9367   162414          Moonlight                   Drama  NaN

In [35]:
movies_df.dropna(subset=['Year'], inplace=True)

In [36]:
movies_df.loc[movies_df['title'] == 'Babylon 5', 'Year'] = '1994'
movies_df.loc[movies_df['title'] == 'Ready Player One', 'Year'] = '2018'
movies_df.loc[movies_df['title'] == 'Nocturnal Animals', 'Year'] = '2016'
movies_df.loc[movies_df['title'] == 'Moonlight', 'Year'] = '2016'

In [37]:
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [38]:
print((movies_df.isnull().sum()))
print((ratings_df.isnull().sum()))

movieId    0
title      0
genres     0
Year       0
dtype: int64
userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [39]:
movies_df.duplicated().sum()
ratings_df.duplicated().sum()

np.int64(0)

In [40]:
movies_df['Year'] = movies_df['Year'].astype(int)

In [41]:
movies_df.dtypes

movieId     int64
title      object
genres     object
Year        int64
dtype: object

In [42]:
ratings_df.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [43]:
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [44]:
ratings_df = ratings_df.reset_index()
ratings_df.head()

   index  userId  movieId  rating  timestamp
0      0       1        1     4.0  964982703
1      1       1        3     4.0  964981247
2      2       1        6     4.0  964982224
3      3       1       47     5.0  964983815
4      4       1       50     5.0  964982931

In [45]:
movies_df.to_csv('/workspace/data/processed/movies.csv', index=False)
ratings_df.to_csv('/workspace/data/processed/ratings.csv', index=False)